Интенсивное_обучение_программированию/src/Documents/РасчетнаяВедомость/РасчетнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетнаяВедомость</name>
  <comment>Расчетная ведомость</comment>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <comment>Список сотрудников</comment>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасоваяСтавка</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <comment>Зарплата</comment>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.День</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВидыРасчета</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <attributes>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Интенсивное_обучение_программированию/src/InformationRegisters/ЧасоваяСтавкаСотрудника/ЧасоваяСтавкаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЧасоваяСтавкаСотрудника</name>
  <comment>Часовая ставка сотрудника</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интенсивное_обучение_программированию/src/Documents/РасчетнаяВедомость/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетнаяВедомостьСписокСотрудников.Ссылка.Дата,
		|	РасчетнаяВедомостьСписокСотрудников.Сотрудник,
		|	РасчетнаяВедомостьСписокСотрудников.ЧасоваяСтавка КАК ЧасоваяСтавка
		|ИЗ
		|	Документ.РасчетнаяВедомость.СписокСотрудников КАК РасчетнаяВедомостьСписокСотрудников
		|ГДЕ
		|	РасчетнаяВедомостьСписокСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;			
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.Зарплата.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение 			= Движения.Зарплата.Добавить();
		Движение.Сторно 	= Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчета.Работа;
		Движение.ПериодРегистрации 		= ВыборкаДетальныеЗаписи.Дата;
		Движение.ПериодДействияНачало 	= НачалоМесяца(ВыборкаДетальныеЗаписи.Дата);
		Движение.ПериодДействияКонец 	= КонецМесяца(ВыборкаДетальныеЗаписи.Дата);
		Движение.Сотрудник 				= ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ЧасоваяСтавка 			= ВыборкаДетальныеЗаписи.ЧасоваяСтавка;
		
	КонецЦикла;

	Движения.Зарплата.Записать();
	Движения.Зарплата.Рассчитать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
    	Возврат;
    	
	КонецЕсли;
		
	Для Каждого СтрокаСотрудника Из СписокСотрудников Цикл
		
		СтрокаСотрудника.ЧасоваяСтавка = РегистрыСведений.ЧасоваяСтавкаСотрудника.ПолучитьЧасовуюСтавку
										(СтрокаСотрудника.Сотрудник, Дата);
										
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
